In [1]:
import pandas as pd

### Series

In [2]:
Age = pd.Series([10,20,30,40], index=['age1','age2','age3','age4'])

In [3]:
Age

age1    10
age2    20
age3    30
age4    40
dtype: int64

#### Extracting one value

In [6]:
ag3 = Age.age3
ag3

30

#### Filtering

In [11]:
Filtered_Age = Age[Age>10]
Filtered_Age

age2    20
age3    30
age4    40
dtype: int64

#### Getting values

In [12]:
Age.values

array([10, 20, 30, 40])

In [13]:
Age.value_counts

<bound method IndexOpsMixin.value_counts of age1    10
age2    20
age3    30
age4    40
dtype: int64>

#### Getting indexes of the series

In [14]:
Age.index

Index(['age1', 'age2', 'age3', 'age4'], dtype='object')

#### Change index

In [15]:
Age.index = ['A1','A2', 'A3', 'A4']

In [16]:
Age

A1    10
A2    20
A3    30
A4    40
dtype: int64

### DataFrames

In [17]:
import numpy as np

In [18]:
df = np.array([[20,10,8], [25,8,10], [27,5,3], [30,9,7]])
df

array([[20, 10,  8],
       [25,  8, 10],
       [27,  5,  3],
       [30,  9,  7]])

In [19]:
data_set = pd.DataFrame(df)
data_set

    0   1   2
0  20  10   8
1  25   8  10
2  27   5   3
3  30   9   7

In [20]:
data_set.dtypes

0    int64
1    int64
2    int64
dtype: object

In [23]:
data_set = pd.DataFrame(df, index=['S1','S2','S3','S4'], columns=['Age', 'Grade1','Grade2'])
data_set

    Age  Grade1  Grade2
S1   20      10       8
S2   25       8      10
S3   27       5       3
S4   30       9       7

In [24]:
data_set['Grade3'] = [9,6,7,10]
data_set

    Age  Grade1  Grade2  Grade3
S1   20      10       8       9
S2   25       8      10       6
S3   27       5       3       7
S4   30       9       7      10

#### Selecting a row from dataframe by name-> using `loc` class

In [27]:
data_set.loc['S2']

Age       25
Grade1     8
Grade2    10
Grade3     6
Name: S2, dtype: int64

In [29]:
R3 = data_set.loc['S3']
R3

Age       27
Grade1     5
Grade2     3
Grade3     7
Name: S3, dtype: int64

#### Using index -> using `iloc` class

In [32]:
data_set.iloc[1][3]

6

In [34]:
data_set.iloc[0, 3]

9

#### Separating one column

In [36]:
data_set.iloc[:,3] #All the rows for the third column

S1     9
S2     6
S3     7
S4    10
Name: Grade3, dtype: int64

In [37]:
data_set.iloc[:,0]

S1    20
S2    25
S3    27
S4    30
Name: Age, dtype: int64

#### Selecting all columns, some rows

In [42]:
filtered_df = data_set.iloc[:,1:3] # the last column is not counted when defining the end
filtered_df

    Grade1  Grade2
S1      10       8
S2       8      10
S3       5       3
S4       9       7

#### Dropping values

In [44]:
# axis -> define if it is in row(0 -horizontal) or column(1 -vertical)
data_set.drop('Grade1', axis=1)

    Age  Grade2  Grade3
S1   20       8       9
S2   25      10       6
S3   27       3       7
S4   30       7      10

#### Replacing values

In [47]:
Data_set = data_set.replace(10,12)
Data_set

    Age  Grade1  Grade2  Grade3
S1   20      12       8       9
S2   25       8      12       6
S3   27       5       3       7
S4   30       9       7      12

#### Repalcing multiple values with dictionary

In [48]:
Data_set2 = data_set.replace({12:10, 9:30})
Data_set2

    Age  Grade1  Grade2  Grade3
S1   20      10       8      30
S2   25       8      10       6
S3   27       5       3       7
S4   30      30       7      10

#### Getting tail & head

In [49]:
data_set.head(2)

    Age  Grade1  Grade2  Grade3
S1   20      10       8       9
S2   25       8      10       6

In [50]:
data_set.tail(2)

    Age  Grade1  Grade2  Grade3
S3   27       5       3       7
S4   30       9       7      10

#### Sorting labels

In [57]:
data_set.sort_values(by='Grade1',ascending=True)

    Age  Grade1  Grade2  Grade3
S3   27       5       3       7
S2   25       8      10       6
S4   30       9       7      10
S1   20      10       8       9

#### Sorting by indexes

In [56]:
data_set.sort_index(axis=0, ascending=False)

    Age  Grade1  Grade2  Grade3
S4   30       9       7      10
S3   27       5       3       7
S2   25       8      10       6
S1   20      10       8       9

#### Opening a dataset in CSV

In [58]:
import os
working_dir = os.getcwd()

In [60]:
data_path = working_dir + '/Data_Set.csv'
data_path

'/Users/nathalia/Personal/code-practice/machine-learning/ML & Data Science/Course codes/ML_packages/Data_Set.csv'

In [61]:
data_ex = pd.read_csv(data_path)

In [63]:
data_ex

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12
4,3,16,34,11,-19,12
5,3,16,34,11,-19,12
6,4,16,33,12,-18,12
7,5,16,30,10,-14,12
8,6,16,31,10,-16,12
9,7,19,28,14,-14,12
10,8,22,29,12,-15,9
11,9,25,26,12,-12,8
12,10,26,24,14,-8,8
13,11,27,20,14,-4,8
14,12,30,19,16,0,5
15,13,30,19,16,0,4
16,14,NaN,13,17,2,4
17,15,27,14,17,3,4
18,16,27,16,17,2,6
19,17,28,-4,18,0,8
20,18,33,26,20,-6,9
21,19,42,32,21,-8,10
22,20,120,33,21,-12,12
23,21,47,32,21,-16,12
24,22,44,30,22,-18,12
25,23,36,35,!,-19,12
26,24,37,36,18,-22,12